<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Comment</key>
    <string>Recipe to download and package the latest Blender version for macOS (ARM64) from official Blender site</string>
    <key>Identifier</key>
    <string>com.github.autopkg.blender.latest</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Blender</string>
        <key>BASE_URL</key>
        <string>https://download.blender.org/release/</string>
        <key>VERSION_PAGE</key>
        <string>https://www.blender.org/download/</string>
        <key>PKG_ID</key>
        <string>org.blender.Blender</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%VERSION_PAGE%</string>
                <key>re_pattern</key>
                <string>Blender (\d+\.\d+\.\d+)</string>
                <key>result_output_var_name</key>
                <string>version</string>
                <key>request_headers</key>
                <dict>
                    <key>User-Agent</key>
                    <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/91.0.4472.114 Safari/537.36</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%BASE_URL%Blender%version%/blender-%version%-macos-arm64.dmg</string>
                <key>filename</key>
                <string>%NAME%-%version%.dmg</string>
                <key>CURL_OPTIONS</key>
                <array>
                    <string>--fail</string>
                    <string>--location</string>
                    <string>--silent</string>
                    <string>--show-error</string>
                </array>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_request</key>
                <dict>
                    <key>chown</key>
                    <dict>
                        <key>/Applications/Blender.app</key>
                        <dict>
                            <key>group</key>
                            <string>admin</string>
                            <key>user</key>
                            <string>root</string>
                        </dict>
                    </dict>
                    <key>id</key>
                    <string>%PKG_ID%</string>
                    <key>options</key>
                    <string>purge_ds_store</string>
                    <key>pkgroot</key>
                    <string>/Applications</string>
                    <key>pkgname</key>
                    <string>%NAME%-%version%</string>
                    <key>version</key>
                    <string>%version%</string>
                </dict>
            </dict>
        </dict>
    </array>
</dict>
</plist>